package z_exam;

public class Question {

	public static void main(String[] args) {
		
		// 명명규칙 5가지를 적어주세요.

		// 기본형 데이터의 이름과 데이터 값, 표현범위를 적어주세요.

		// 참조형 타입(데이터)의 특성 3가지를 적어주세요.

		// 리터럴의 종류를 적어주세요. (3가지씩)
		//- 숫자:
		//- 문자:
		//- 문자열:
		//- 그외:

		// 모든 기본형 타입을 사용해서 8개의 변수를 선언해주세요.

		// 위에서 만든 변수들을 표현범위가 작은 타입으로 형변환 해주세요. (3번 이상)

		// 위에서 만든 변수들을 표현범위가 큰 타입으로 형변환 해주세요. (3번 이상)

		// 문자열을 입력받고 입력받은 문자열을 출력해주세요.

		// 숫자를 입력받고 입력받은 숫자를 출력해주세요.

		// 위에서 입력받은 문자열과 숫자를 더해서 출력해주세요.

		// 다음 문제의 출력 결과값을 적어주세요.
		//int g1 = 10 / 0; 
		//float g2 = 10.0f / 0;
		//float g3 = 0 / 0f;
		//int h3 = 'D' - 'A';
		//int h4 = '5' - '0';

		// 소수점 둘째자리에서 반올림 해주세요.

		//문제1. 다음을 한줄씩 계산해서 최종 결과값을 출력해주세요.
		//1. 123456 + 654321
		//2. 1번의 결과값 * 123456
		//3. 2번의 결과값 / 123456
		//4. 3번의 결과값 - 654321
		//5. 4번의 결과값 % 123456

		//문제2. 3개의 int형 변수를 선언 및 초기화 후 합계와 평균을 구해주세요.
		//(평균은 소수점 둘째자리에서 반올림)

		// i는 1씩 증가한다/감소한다/곱한다/나눈다/나머지의 연산자를 적어주세요. (2가지 이상)
		// (증가/감소의 경우에는 4가지)

		// 다음의 문장을 코드로 표현해주세요.
		//1보다 2가 크다.
		//0은 100보다 작거나 같다.
		//3.14f와 3.14는 같지 않다.
		//"남자"와 "여자"는 다르다.

		//다음의 문장들을 코드로 작성해주세요.
		//x가 2의 배수이고 10보다 작은가?
		//x가 2의 배수이거나 3의 배수이거나 5의 배수인가?

		//52는 2진수로, 00100101는 10진수로 바꾸어보세요.

		//주민등록번호 뒷자리의 첫 번째 숫자가 1이면 남자, 2면 여자
		//int regNo = 5; //주민등록번호 첫 자리
		//(1이나 2가 아니면 확인불가로 표시하세요.)

		//두 개의 변수에 저장된 수 중에 큰 숫자를 출력해주세요.
		//(변수 임의 지정)

		//변수에 저장된 주민등록번호 뒷자리의 첫 번째 숫자가 1이나 3이면 남자를,
		//2나 4면 여자를 출력해주세요.
		//그 외의 숫자를 입력하면 "잘못 입력하셨습니다."를 출력해주세요.

		//다음의 문장들을 코드로 작성해주세요.
		//- x가 2의 배수이고 10보다 작은가?
		//- x가 2의 배수이거나 3의 배수이거나 5의 배수인가?

		//성적에 등급을 부여하는 프로그램을 만들어보자.	
		//등급 안에서 +와 -를 나누어보자.

		//문제1. 숫자를 입력받아 그 숫자가 0인지 0이 아닌지 출력해주세요.
		//문제2. 숫자를 입력받아 그 숫자가 홀수인지 짝수인지 출력해주세요.
		//문제3. 정수 3개를 입력받아 총점, 평균, 등급을 출력해주세요.

		//1부터 100까지 홀수의 합을 구해주세요.

		//구구단을 출력해보자.
		//7단을 출력해보자.
		//구구단 전체의 짝수단의 홀수줄만 출력해주세요.
		//구구단 전체를 가로로 출력해주세요.

		//숫자 맞추기 게임을 만들어보자.
		//야구볼 게임을 만들어보자.

		//정수를 저장할 수 있는 길이가 10인 배열을 생성 및 초기화해주세요.
		//모든 인덱스에 있는 값을 변경해주세요.
		//모든 인덱스에 있는 값을 더해주세요.
		//배열의 숫자를 저장하고 합계와 평균을 구해주세요.

		//배열에 저장된 숫자들 중 최소값과 최대값을 찾아주세요. (shuffle 배열을 사용해주세요)
		//배열의 값을 섞어주세요.
		//shuffle 의 길이를 *2배로 변경해주세요. (메서드 사용 x)
		//originArray 배열을 10까지 선언 및 초기화하고 copyArray에 *2배 값으로 저장해주세요. (메서드 사용 x)
















		
		
		
		
		
		
		
		
		
		

	}

}
